Repository: rohin032/AgriXNet
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hi

source: Home
hi: होम

source: Crop Recommendation
hi: फसल अनुशंसा

source: Disease Prediction
hi: रोग भविष्यवाणी

source: Language
hi: भाषा

source: Get Informed Decisions About Your Farming Strategy
hi: अपनी खेती की रणनीति के बारे में सूचित निर्णय लें

source: We Help You Answer:
hi: हम आपकी मदद करते हैं:

source: What crop to plant here?
hi: यहां कौन सी फसल लगाएं?

source: Which disease do your crops have?
hi: आपकी फसलों में कौन सी बीमारी है?

source: How to cure the disease?
hi: बीमारी का इलाज कैसे करें?

source: Explore Services
hi: सेवाओं का अन्वेषण करें

source: Enhancing Agriculture, Enriching Lives
hi: कृषि को बढ़ावा देना, जीवन को समृद्ध करना

source: We leverage cutting-edge machine learning and deep learning technologies to guide you through every stage of farming. Our platform enables data-driven decisions by analyzing local demographics, crop-specific factors, and ensuring optimal crop health for maximum productivity.
hi: हम आपको खेती के हर चरण में मार्गदर्शन करने के लिए अत्याधुनिक मशीन लर्निंग और डीप लर्निंग तकनीकों का उपयोग करते हैं। हमारा प्लेटफॉर्म स्थानीय जनसांख्यिकी, फसल-विशिष्ट कारकों का विश्लेषण करके और अधिकतम उत्पादकता के लिए इष्टतम फसल स्वास्थ्य सुनिश्चित करके डेटा-संचालित निर्णयों को सक्षम बनाता है।

source: Our Services
hi: हमारी सेवाएं

source: Receive expert recommendations on the most suitable crops for your specific environmental conditions.
hi: अपनी विशिष्ट पर्यावरणीय परिस्थितियों के लिए सबसे उपयुक्त फसलों पर विशेषज्ञ सिफारिशें प्राप्त करें।

source: Identify crop diseases with precision and receive targeted treatment recommendations.
hi: फसल रोगों की सटीक पहचान करें और लक्षित उपचार सिफारिशें प्राप्त करें।

source: All rights reserved.
hi: सर्वाधिकार सुरक्षित।

source: Find out which disease has been caught by your plant
hi: पता करें कि आपके पौधे को कौन सी बीमारी ने पकड़ा है

source: Please Upload The Image
hi: कृपया छवि अपलोड करें

source: Predict
hi: भविष्यवाणी करें

source: Crop Recommendation System
hi: फसल अनुशंसा प्रणाली

source: Nitrogen
hi: नाइट्रोजन

source: Enter Nitrogen
hi: नाइट्रोजन दर्ज करें

source: Phosphorus
hi: फॉस्फोरस

source: Enter Phosphorus
hi: फॉस्फोरस दर्ज करें

source: Potassium
hi: पोटैशियम

source: Enter Potassium
hi: पोटैशियम दर्ज करें

source: Temperature (°C)
hi: तापमान (°C)

source: Enter Temperature
hi: तापमान दर्ज करें

source: Humidity
hi: आर्द्रता

source: Enter Humidity
hi: आर्द्रता दर्ज करें

source: pH
hi: पीएच

source: Enter pH value
hi: पीएच मान दर्ज करें

source: Rainfall (mm)
hi: वर्षा (मिमी)

source: Enter Rainfall
hi: वर्षा दर्ज करें

source: Get Recommendation
hi: सिफारिश प्राप्त करें

source: Recommended Crop:
hi: अनुशंसित फसल:

source: %(crop)s is the best crop to be cultivated right there
hi: %(crop)s वहां उगाने के लिए सबसे अच्छी फसल है

source: Sorry, we could not determine the best crop to be cultivated with the provided data.
hi: माफ़ कीजिए, हम दिए गए डेटा के साथ सबसे अच्छी फसल निर्धारित नहीं कर सके।
